meliksahaltuntas/NucleoWB55/Projects/NUCLEO_BLE_TEST/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_p2pServer/STM32_WPAN/App/app_ble.c
  /* Update Advertising data */
  ret = aci_gap_update_adv_data(sizeof(a_ManufData), (uint8_t*) a_ManufData);
  if (ret != BLE_STATUS_SUCCESS)
  {
    if (NewStatus == APP_BLE_FAST_ADV)
    {
      APP_DBG_MSG("==>> Start Fast Advertising Failed , result: %d \n\r", ret);
    }
    else
    {
      APP_DBG_MSG("==>> Start Low Power Advertising Failed , result: %d \n\r", ret);
    }
  }
  else
  {
    if (NewStatus == APP_BLE_FAST_ADV)
    {
      APP_DBG_MSG("==>> Success: Start Fast Advertising \n\r");
      /* Start Timer to STOP ADV - TIMEOUT - and next Restart Low Power Advertising */
      HW_TS_Start(BleApplicationContext.Advertising_mgr_timer_Id, INITIAL_ADV_TIMEOUT);
    }
    else
    {
      APP_DBG_MSG("==>> Success: Start Low Power Advertising \n\r");
    }
  }

  return;
}

const uint8_t* BleGetBdAddress(void)
{
  uint8_t *p_otp_addr;
  const uint8_t *p_bd_addr;
  uint32_t udn;
  uint32_t company_id;
  uint32_t device_id;

  udn = LL_FLASH_GetUDN();

  if (udn != 0xFFFFFFFF)
  {
    company_id = LL_FLASH_GetSTCompanyID();
    device_id = LL_FLASH_GetDeviceID();

    /**
     * Public Address with the ST company ID
     * bit[47:24] : 24bits (OUI) equal to the company ID
     * bit[23:16] : Device ID.
     * bit[15:0] : The last 16bits from the UDN
     * Note: In order to use the Public Address in a final product, a dedicated
     * 24bits company ID (OUI) shall be bought.
     */
    a_BdAddrUdn[0] = (uint8_t)(udn & 0x000000FF);
    a_BdAddrUdn[1] = (uint8_t)((udn & 0x0000FF00) >> 8);
    a_BdAddrUdn[2] = (uint8_t)device_id;
    a_BdAddrUdn[3] = (uint8_t)(company_id & 0x000000FF);
    a_BdAddrUdn[4] = (uint8_t)((company_id & 0x0000FF00) >> 8);
    a_BdAddrUdn[5] = (uint8_t)((company_id & 0x00FF0000) >> 16);

    p_bd_addr = (const uint8_t *)a_BdAddrUdn;
  }
  else
  {
    p_otp_addr = OTP_Read(0);
    if (p_otp_addr)
    {
      p_bd_addr = ((OTP_ID0_t*)p_otp_addr)->bd_address;
    }
    else
    {
      p_bd_addr = a_MBdAddr;
    }
  }

  return p_bd_addr;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */
static void Update_Device_Name_With_Counter(void)
{
    tBleStatus ret;

    // Create the new name
    snprintf(current_device_name, sizeof(current_device_name), "%s%04d", base_name, current_name_counter);

    // Prepare scan response data with complete local name
    uint8_t name_len = strlen(current_device_name);
    scan_response_length = name_len + 2; // +2 for length and AD type

    if (scan_response_length <= 31) {
        scan_response_data[0] = name_len + 1; // Length includes AD type
        scan_response_data[1] = AD_TYPE_COMPLETE_LOCAL_NAME;
        memcpy(&scan_response_data[2], current_device_name, name_len);

        // Set scan response data
        ret = hci_le_set_scan_response_data(scan_response_length, scan_response_data);
        if (ret == BLE_STATUS_SUCCESS) {
            APP_DBG_MSG("Scan response updated with name: %s\n", current_device_name);
        } else {
            APP_DBG_MSG("Failed to set scan response data: 0x%x\n", ret);
        }
    }

    // Update GATT device name characteristic if connected
    if (BleApplicationContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER) {
        ret = aci_gatt_update_char_value(BleApplicationContext.BleApplicationContext_legacy.gapServiceHandle,
                                        BleApplicationContext.BleApplicationContext_legacy.devNameCharHandle,
                                        0,
                                        name_len,
                                        (uint8_t*)current_device_name);
        if (ret == BLE_STATUS_SUCCESS) {
            APP_DBG_MSG("GATT device name updated: %s\n", current_device_name);
        }
    }
}

static void Name_Change_Timeout(void)
{
    name_change_pending = 1;
    UTIL_SEQ_SetTask(1 << CFG_TASK_NAME_UPDATE_ID, CFG_SCH_PRIO_0); // You'll need to define this task ID
}

static void Process_Name_Change(void)
{
    if (name_change_pending) {
        name_change_pending = 0;
        current_name_counter++;

        APP_DBG_MSG("Changing device name to: %s%04d\n", base_name, current_name_counter);

        // Stop current advertising
        if (BleApplicationContext.Device_Connection_Status == APP_BLE_FAST_ADV ||
            BleApplicationContext.Device_Connection_Status == APP_BLE_LP_ADV) {

            tBleStatus ret = aci_gap_set_non_discoverable();
            if (ret == BLE_STATUS_SUCCESS) {
                // Update name and restart advertising
                Update_Device_Name_With_Counter();

                // Restart advertising with new name
                Adv_Request(APP_BLE_FAST_ADV);
            }
        } else {
            // Just update the name
            Update_Device_Name_With_Counter();
        }

        // Restart timer for next name change (1 minute = 60000000 microseconds)
        HW_TS_Start(Name_Change_timer_Id, (60*1000*1000/CFG_TS_TICK_VAL));
    }
}
/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 * SPECIFIC FUNCTIONS FOR P2P SERVER
 *
 *************************************************************/
static void Adv_Cancel(void)
{
  /* USER CODE BEGIN Adv_Cancel_1 */
  BSP_LED_Off(LED_GREEN);
  /* USER CODE END Adv_Cancel_1 */

  if (BleApplicationContext.Device_Connection_Status != APP_BLE_CONNECTED_SERVER)
  {
    tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

    ret = aci_gap_set_non_discoverable();

    BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("** STOP ADVERTISING **  Failed \r\n\r");
    }
    else
    {
      APP_DBG_MSG("  \r\n\r");
      APP_DBG_MSG("** STOP ADVERTISING **  \r\n\r");
    }
  }

  /* USER CODE BEGIN Adv_Cancel_2 */

  /* USER CODE END Adv_Cancel_2 */

  return;
}

static void Adv_Cancel_Req(void)
{
  /* USER CODE BEGIN Adv_Cancel_Req_1 */

  /* USER CODE END Adv_Cancel_Req_1 */

  UTIL_SEQ_SetTask(1 << CFG_TASK_ADV_CANCEL_ID, CFG_SCH_PRIO_0);

  /* USER CODE BEGIN Adv_Cancel_Req_2 */

